{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|user|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|assistant|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "<|user|>": 2,
      "<|assistant|>": 3,
      "<|end|>": 4,
      "!": 5,
      "\"": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      "@": 28,
      "A": 29,
      "B": 30,
      "C": 31,
      "D": 32,
      "E": 33,
      "F": 34,
      "G": 35,
      "H": 36,
      "I": 37,
      "J": 38,
      "K": 39,
      "L": 40,
      "M": 41,
      "N": 42,
      "O": 43,
      "P": 44,
      "Q": 45,
      "R": 46,
      "S": 47,
      "T": 48,
      "U": 49,
      "V": 50,
      "W": 51,
      "X": 52,
      "Y": 53,
      "_": 54,
      "a": 55,
      "b": 56,
      "c": 57,
      "d": 58,
      "e": 59,
      "f": 60,
      "g": 61,
      "h": 62,
      "i": 63,
      "j": 64,
      "k": 65,
      "l": 66,
      "m": 67,
      "n": 68,
      "o": 69,
      "p": 70,
      "q": 71,
      "r": 72,
      "s": 73,
      "t": 74,
      "u": 75,
      "v": 76,
      "w": 77,
      "x": 78,
      "y": 79,
      "z": 80,
      "—": 81,
      "’": 82,
      "th": 83,
      "er": 84,
      "or": 85,
      "on": 86,
      "in": 87,
      "te": 88,
      "re": 89,
      "an": 90,
      "the": 91,
      "ct": 92,
      "ou": 93,
      "ro": 94,
      "is": 95,
      "ect": 96,
      "ion": 97,
      "at": 98,
      "of": 99,
      "ute": 100,
      "ber": 101,
      "ar": 102,
      "nber": 103,
      "nberg": 104,
      "ic": 105,
      "utenberg": 106,
      "ing": 107,
      "en": 108,
      "Pro": 109,
      "ject": 110,
      "Gutenberg": 111,
      "Project": 112,
      "al": 113,
      "wor": 114,
      "work": 115,
      "se": 116,
      "to": 117,
      "it": 118,
      "co": 119,
      "es": 120,
      "and": 121,
      "ation": 122,
      "wi": 123,
      "ed": 124,
      "for": 125,
      "you": 126,
      "tm": 127,
      "ri": 128,
      "with": 129,
      "ate": 130,
      "ag": 131,
      "nd": 132,
      "ent": 133,
      "ch": 134,
      "iv": 135,
      "el": 136,
      "pl": 137,
      "em": 138,
      "any": 139,
      "dis": 140,
      "st": 141,
      "this": 142,
      "pro": 143,
      "cop": 144,
      "ay": 145,
      "ce": 146,
      "id": 147,
      "no": 148,
      "ra": 149,
      "ter": 150,
      "rib": 151,
      "ll": 152,
      "works": 153,
      "le": 154,
      "trib": 155,
      "ted": 156,
      "elect": 157,
      "ron": 158,
      "ound": 159,
      "ive": 160,
      "electron": 161,
      "electronic": 162,
      "as": 163,
      "ut": 164,
      "all": 165,
      "copy": 166,
      "ain": 167,
      "ht": 168,
      "per": 169,
      "form": 170,
      "distrib": 171,
      "not": 172,
      "ac": 173,
      "agre": 174,
      "Found": 175,
      "are": 176,
      "do": 177,
      "fu": 178,
      "com": 179,
      "Foundation": 180,
      "ab": 181,
      "be": 182,
      "ol": 183,
      "par": 184,
      "ww": 185,
      "out": 186,
      "ement": 187,
      "ess": 188,
      "Th": 189,
      "con": 190,
      "la": 191,
      "ms": 192,
      "ow": 193,
      "by": 194,
      "don": 195,
      "ph": 196,
      "wh": 197,
      "ations": 198,
      "oo": 199,
      "us": 200,
      "ated": 201,
      "terms": 202,
      "ad": 203,
      "ght": 204,
      "il": 205,
      "oth": 206,
      "ary": 207,
      "ense": 208,
      "agreement": 209,
      "Boo": 210,
      "ci": 211,
      "ee": 212,
      "eBoo": 213,
      "im": 214,
      "un": 215,
      "right": 216,
      "prov": 217,
      "eBook": 218,
      "fro": 219,
      "ta": 220,
      "use": 221,
      "ates": 222,
      "distribut": 223,
      "acc": 224,
      "other": 225,
      "from": 226,
      "If": 227,
      "can": 228,
      "lic": 229,
      "may": 230,
      "su": 231,
      "sion": 232,
      "um": 233,
      "org": 234,
      "compl": 235,
      "provid": 236,
      "Ar": 237,
      "Lit": 238,
      "am": 239,
      "cl": 240,
      "ef": 241,
      "if": 242,
      "ies": 243,
      "ited": 244,
      "pu": 245,
      "so": 246,
      "that": 247,
      "erary": 248,
      "ark": 249,
      "ition": 250,
      "agra": 251,
      "chive": 252,
      "copyright": 253,
      "paragra": 254,
      "The": 255
    },
    "merges": [
      [
        "t",
        "h"
      ],
      [
        "e",
        "r"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "n"
      ],
      [
        "i",
        "n"
      ],
      [
        "t",
        "e"
      ],
      [
        "r",
        "e"
      ],
      [
        "a",
        "n"
      ],
      [
        "th",
        "e"
      ],
      [
        "c",
        "t"
      ],
      [
        "o",
        "u"
      ],
      [
        "r",
        "o"
      ],
      [
        "i",
        "s"
      ],
      [
        "e",
        "ct"
      ],
      [
        "i",
        "on"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "f"
      ],
      [
        "u",
        "te"
      ],
      [
        "b",
        "er"
      ],
      [
        "a",
        "r"
      ],
      [
        "n",
        "ber"
      ],
      [
        "nber",
        "g"
      ],
      [
        "i",
        "c"
      ],
      [
        "ute",
        "nberg"
      ],
      [
        "in",
        "g"
      ],
      [
        "e",
        "n"
      ],
      [
        "P",
        "ro"
      ],
      [
        "j",
        "ect"
      ],
      [
        "G",
        "utenberg"
      ],
      [
        "Pro",
        "ject"
      ],
      [
        "a",
        "l"
      ],
      [
        "w",
        "or"
      ],
      [
        "wor",
        "k"
      ],
      [
        "s",
        "e"
      ],
      [
        "t",
        "o"
      ],
      [
        "i",
        "t"
      ],
      [
        "c",
        "o"
      ],
      [
        "e",
        "s"
      ],
      [
        "an",
        "d"
      ],
      [
        "at",
        "ion"
      ],
      [
        "w",
        "i"
      ],
      [
        "e",
        "d"
      ],
      [
        "f",
        "or"
      ],
      [
        "y",
        "ou"
      ],
      [
        "t",
        "m"
      ],
      [
        "r",
        "i"
      ],
      [
        "wi",
        "th"
      ],
      [
        "a",
        "te"
      ],
      [
        "a",
        "g"
      ],
      [
        "n",
        "d"
      ],
      [
        "en",
        "t"
      ],
      [
        "c",
        "h"
      ],
      [
        "i",
        "v"
      ],
      [
        "e",
        "l"
      ],
      [
        "p",
        "l"
      ],
      [
        "e",
        "m"
      ],
      [
        "an",
        "y"
      ],
      [
        "d",
        "is"
      ],
      [
        "s",
        "t"
      ],
      [
        "th",
        "is"
      ],
      [
        "p",
        "ro"
      ],
      [
        "co",
        "p"
      ],
      [
        "a",
        "y"
      ],
      [
        "c",
        "e"
      ],
      [
        "i",
        "d"
      ],
      [
        "n",
        "o"
      ],
      [
        "r",
        "a"
      ],
      [
        "t",
        "er"
      ],
      [
        "ri",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "work",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "t",
        "rib"
      ],
      [
        "te",
        "d"
      ],
      [
        "el",
        "ect"
      ],
      [
        "r",
        "on"
      ],
      [
        "ou",
        "nd"
      ],
      [
        "iv",
        "e"
      ],
      [
        "elect",
        "ron"
      ],
      [
        "electron",
        "ic"
      ],
      [
        "a",
        "s"
      ],
      [
        "u",
        "t"
      ],
      [
        "al",
        "l"
      ],
      [
        "cop",
        "y"
      ],
      [
        "a",
        "in"
      ],
      [
        "h",
        "t"
      ],
      [
        "p",
        "er"
      ],
      [
        "for",
        "m"
      ],
      [
        "dis",
        "trib"
      ],
      [
        "no",
        "t"
      ],
      [
        "a",
        "c"
      ],
      [
        "ag",
        "re"
      ],
      [
        "F",
        "ound"
      ],
      [
        "a",
        "re"
      ],
      [
        "d",
        "o"
      ],
      [
        "f",
        "u"
      ],
      [
        "co",
        "m"
      ],
      [
        "Found",
        "ation"
      ],
      [
        "a",
        "b"
      ],
      [
        "b",
        "e"
      ],
      [
        "o",
        "l"
      ],
      [
        "p",
        "ar"
      ],
      [
        "w",
        "w"
      ],
      [
        "ou",
        "t"
      ],
      [
        "em",
        "ent"
      ],
      [
        "es",
        "s"
      ],
      [
        "T",
        "h"
      ],
      [
        "c",
        "on"
      ],
      [
        "l",
        "a"
      ],
      [
        "m",
        "s"
      ],
      [
        "o",
        "w"
      ],
      [
        "b",
        "y"
      ],
      [
        "d",
        "on"
      ],
      [
        "p",
        "h"
      ],
      [
        "w",
        "h"
      ],
      [
        "ation",
        "s"
      ],
      [
        "o",
        "o"
      ],
      [
        "u",
        "s"
      ],
      [
        "ate",
        "d"
      ],
      [
        "ter",
        "ms"
      ],
      [
        "a",
        "d"
      ],
      [
        "g",
        "ht"
      ],
      [
        "i",
        "l"
      ],
      [
        "o",
        "th"
      ],
      [
        "ar",
        "y"
      ],
      [
        "en",
        "se"
      ],
      [
        "agre",
        "ement"
      ],
      [
        "B",
        "oo"
      ],
      [
        "c",
        "i"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "Boo"
      ],
      [
        "i",
        "m"
      ],
      [
        "u",
        "n"
      ],
      [
        "ri",
        "ght"
      ],
      [
        "pro",
        "v"
      ],
      [
        "eBoo",
        "k"
      ],
      [
        "f",
        "ro"
      ],
      [
        "t",
        "a"
      ],
      [
        "u",
        "se"
      ],
      [
        "ate",
        "s"
      ],
      [
        "distrib",
        "ut"
      ],
      [
        "ac",
        "c"
      ],
      [
        "oth",
        "er"
      ],
      [
        "fro",
        "m"
      ],
      [
        "I",
        "f"
      ],
      [
        "c",
        "an"
      ],
      [
        "l",
        "ic"
      ],
      [
        "m",
        "ay"
      ],
      [
        "s",
        "u"
      ],
      [
        "s",
        "ion"
      ],
      [
        "u",
        "m"
      ],
      [
        "or",
        "g"
      ],
      [
        "com",
        "pl"
      ],
      [
        "prov",
        "id"
      ],
      [
        "A",
        "r"
      ],
      [
        "L",
        "it"
      ],
      [
        "a",
        "m"
      ],
      [
        "c",
        "l"
      ],
      [
        "e",
        "f"
      ],
      [
        "i",
        "f"
      ],
      [
        "i",
        "es"
      ],
      [
        "i",
        "ted"
      ],
      [
        "p",
        "u"
      ],
      [
        "s",
        "o"
      ],
      [
        "th",
        "at"
      ],
      [
        "er",
        "ary"
      ],
      [
        "ar",
        "k"
      ],
      [
        "it",
        "ion"
      ],
      [
        "ag",
        "ra"
      ],
      [
        "ch",
        "ive"
      ],
      [
        "copy",
        "right"
      ],
      [
        "par",
        "agra"
      ],
      [
        "Th",
        "e"
      ]
    ]
  }
}